import React, { useState } from 'react'
import { Container, Row, Col } from 'react-bootstrap';

const AboutBlock = () => {
    const [readMore, setReadMore] = useState(false);
    const handleCloseReadMore = () => setReadMore(false);
    const handleShowReadMore = () => setReadMore(true);
    const workSchedule = [
        { id: 1, day: 'Понеділок', hours: '8:30-19:00' },
        { id: 2, day: 'Вівторок', hours: '8:30-19:00' },
        { id: 3, day: 'Середа', hours: '8:30-19:00' },
        { id: 4, day: 'Четвер', hours: '8:30-19:00' },
        { id: 5, day: 'Пятниця', hours: '8:30-19:00' },
        { id: 6, day: 'Субота', hours: '8:30-19:00' },
        { id: 7, day: 'Неділя', hours: 'Вихідний' }
    ]

    return (
        <div className="about">
            <Container>
                <Row>
                    <Col lg={8} md={12} sm={12}>
                        <div className="title">
                            Про клініку
                        </div>
                        <div className="about__text">
                            Основна спеціалізація клініки Flexis це лікування і реабілітація пацієнтів з ревматологічними, неврологічними і травматологічними ушкодженнями опорно-рухового апарату.

                            Ми створили велику і ультрасучасну апаратну базу, яка дозволяє проводити комп'ютерне витягування, імпульсно- хвильову терапію, застосовувати для лікування лазерні технології лікування, миостимуляцию, магніторезонансну терапію, внутрішньосуглобові ін'єкції, алопатичну терапію.

                            Сучасні технології в комплексі з апаратурою і лікарським професіоналізмом дозволяють повернути людині колишню активність і інтерес до діяльності в тих життєвих сферах, які здавалися вже безповоротно втраченими.
                        </div>

                        {readMore ? <><div className="about__text">
                            Основна спеціалізація клініки Flexis це лікування і реабілітація пацієнтів з ревматологічними, неврологічними і травматологічними ушкодженнями опорно-рухового апарату.

                            Ми створили велику і ультрасучасну апаратну базу, яка дозволяє проводити комп'ютерне витягування, імпульсно- хвильову терапію, застосовувати для лікування лазерні технології лікування, миостимуляцию, магніторезонансну терапію, внутрішньосуглобові ін'єкції, алопатичну терапію.

                            Сучасні технології в комплексі з апаратурою і лікарським професіоналізмом дозволяють повернути людині колишню активність і інтерес до діяльності в тих життєвих сферах, які здавалися вже безповоротно втраченими.
                        </div> <span onClick={handleCloseReadMore}><u>Зменшити текст</u></span></> : <span onClick={handleShowReadMore}><u>Читати повністю</u></span>}
                    </Col>
                    <Col lg={4} md={12} sm={12}>
                        <div className="title">
                            Графік Роботи
                        </div>
                        <table className="table">
                            <tbody>
                                {workSchedule.map(work =>
                                    <tr key={work.id}>
                                        <td>{work.day}</td>
                                        <th>{work.hours}</th>
                                    </tr>
                                )}
                            </tbody>
                        </table>

                    </Col>
                </Row>
            </Container>
        </div>
    )
}

export default AboutBlock
